app/controllers/admins_backoffice/admins_controller.rb

  def index
    @admins = Admin.all.page params[:page]
---
SELECT  "admins".* FROM "admins" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "admins"

  def edit
    @admin = Admin.find(params[:id])
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]

  def update
    if @admin.update(params_admin)
---
UPDATE "admins" SET "email" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["email", "wandeilson_ferreira@hotmail.com"], ["updated_at", "2019-05-16 19:33:39.452988"], ["id", 12]]

  def create
    @admin = Admin.new(params_admin)
      if @admin.save
---
INSERT INTO "admins" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def destroy
    if @admin.destroy
---
DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 15]]