app/controllers/admins_backoffice/subjects_controller.rb

SELECT  "subjects".* FROM "subjects" ORDER BY "subjects"."description" ASC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "subjects"
---
    def index
        @subjects = Subject.all. order(:description).page(params[:page])

INSERT INTO "subjects" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "fdfdfdf"], ["created_at", "2019-05-21 00:57:02.450664"], ["updated_at", "2019-05-21 00:57:02.450664"]]
---
    def create
      @subject = Subject.new(params_subject)
        if @subject.save

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def edit
      @subject = Subject.find(params[:id])

UPDATE "subjects" SET "description" = ?, "updated_at" = ? WHERE "subjects"."id" = ?  [["description", "Administração Públicavd"], ["updated_at", "2019-05-21 00:56:23.498755"], ["id", 5]]
---
    def update
      if @subject.update(params_subject)

DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 25]]
---
     def destroy
      if @subject.destroy